# Getting started with Pandas

1. Official Pandas tutorial (https://pandas.pydata.org/)
2. Pandas is one of the most used library for data science

In [2]:
import pandas as pd
import numpy as np


#Pandas has two main data structures:

1. Series

2. Dataframe

In [ ]:
# from pandas import Series, DataFrame

## **Series**
1. Sequence of values, similar to numpy array
2. Each data value is associated to a label
  - Left side represents the index (data labels)
  - Right side represents the data

### Create a Series

In [3]:
obj = pd.Series([4, 7, -5, 3])
obj

0    4
1    7
2   -5
3    3
dtype: int64

In [4]:
obj.values

array([ 4,  7, -5,  3])

In [5]:
type(obj.values)

numpy.ndarray

In [6]:
obj.index  # like range(4)

RangeIndex(start=0, stop=4, step=1)

In [7]:
type(obj.index)

pandas.core.indexes.range.RangeIndex

- We can specify the labels.

In [8]:
obj2 = pd.Series([4, 7, -5, 3], index=['d', 'b', 'a', 'c'])
obj2

d    4
b    7
a   -5
c    3
dtype: int64

In [9]:
obj2.index

Index(['d', 'b', 'a', 'c'], dtype='object')

In [10]:
type(obj2.index)

pandas.core.indexes.base.Index

### Numpy-like operations
1. Filtering with a boolean array
2. Scalar multiplication
3. Applying math functions

They will preserve the index-value link

In [11]:
obj2['b']

np.int64(7)

In [ ]:
obj2['b']=4

In [ ]:
obj2['b']

In [ ]:
obj2

In [ ]:
obj2[:'a']    # obj2[:3]    ATTENZIONE!!!

In [ ]:
type(obj2[:2])

In [ ]:
obj2

In [ ]:
obj2[['c', 'a', 'd', 'd', 'a']]

In [ ]:
type(obj2[['c', 'a', 'd', 'd', 'a']])

In [ ]:
obj2>2

In [ ]:
type(obj2>2)

In [ ]:
obj2[obj2 > 2]

In [ ]:
type(obj2[obj2 > 2])

In [ ]:
'a' in obj2    # controllo se un valore è tra gli indici della Series

In [ ]:
3 in obj2

In [ ]:
3 in obj2.values

In [ ]:
obj2.isin([3])

In [ ]:
obj2 == 3

In [ ]:
(obj2 == 3).any()

### Math operations

Element wise casting

Given $ X = \left[ x_1 \cdots x_n \right] $ then:<br> $ X * 2  = \left[ 2 x_1  \cdots 2{x_n} \right]
$
 <br> $
e^X = \left[ e^{x_1} \cdots e^{x_n} \right]
$

In [ ]:
obj2

In [ ]:
obj2 * 2

In [ ]:
np.exp(obj2)

### Use alignment of indexes for some operations

In [ ]:
obj3 = pd.Series([1,2,3], index=['a', 'b', 'c'])

In [ ]:
obj4 = pd.Series([1,2,3], index=['a', 'd', 'e'])

In [ ]:
obj3 + obj4

In [ ]:
obj3.add(obj4, fill_value=0)

### From Series to Dictionary and viceversa

- Another way to think about a Series is as a fixed-length, ordered dict, as it is a mapping of index values to data values.

In [12]:
obj2

d    4
b    7
a   -5
c    3
dtype: int64

In [16]:
obj2.to_dict()

{'d': 4, 'b': 7, 'a': -5, 'c': 3}

In [14]:
obj2.to_dict().keys()

dict_keys(['d', 'b', 'a', 'c'])

In [15]:
obj2.to_dict().values()

dict_values([4, 7, -5, 3])

- The index of the resulting Series will have the dict's keys
- The data values of the Series are the values of the dict

In [ ]:
sdata = {'Ohio': 35000, 'Texas': 71000, 'Oregon': 16000, 'Utah': 5000}
obj3 = pd.Series(sdata)
obj3

In [ ]:
obj3.index

In [ ]:
obj3.values

In [ ]:
type(obj3)

- Selecting the values of the Series based on the index values and forcing the order of the index

In [ ]:
sdata

In [ ]:
states = ['Ohio', 'California', 'Oregon', 'Texas']
obj4 = pd.Series(sdata, index=states)
obj4

In [ ]:
pd.isnull(obj4)

In [ ]:
pd.notnull(obj4)

In [ ]:
obj4.isnull()

### Dropping entries: method *.drop*

In [23]:
obj = pd.Series(np.arange(5.), index=['a', 'b', 'c', 'd', 'e'])
obj

a    0.0
b    1.0
c    2.0
d    3.0
e    4.0
dtype: float64

In [18]:
obj.drop('c')

a    0.0
b    1.0
d    3.0
e    4.0
dtype: float64

In [22]:
obj

a    0.0
b    1.0
d    3.0
e    4.0
dtype: float64

In [20]:
new_obj = obj.drop('c')
new_obj

a    0.0
b    1.0
d    3.0
e    4.0
dtype: float64

In [25]:
obj.drop('c', inplace=True)
obj

a    0.0
b    1.0
d    3.0
e    4.0
dtype: float64

### Giving a name to the Series
- The name of the Series becomes its index or column name if it is used to form a DataFrame.
- It is also used whenever displaying the Series using the interpreter.

In [27]:
obj.name = 'population'
obj

a    0.0
b    1.0
d    3.0
e    4.0
Name: population, dtype: float64

In [29]:
obj.index.name = 'state'

In [31]:
obj

state
a    0.0
b    1.0
d    3.0
e    4.0
Name: population, dtype: float64

## **DataFrame**
1. Represents a rectangular table of data
2. Contains an ordered collection of columns
3. Has indexes on columns and rows
4. Each column can have a different type (i.e., numeric, string, boolean, etc.)

### Create a Dataframe

In [32]:
data = {'state': ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada', 'Nevada'],
        'year': [2000, 2001, 2002, 2001, 2002, 2003],
        'pop': [1.5, 1.7, 3.6, 2.4, 2.9, 3.2]}
frame = pd.DataFrame(data)

In [33]:
frame

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9
5  Nevada  2003  3.2

In [ ]:
frame.shape

In [ ]:
frame.head(3) # default: 5

In [ ]:
frame.tail(3)

In [34]:
frame.sample() # default: 1

    state  year  pop
4  Nevada  2002  2.9

In [35]:
frame.columns

Index(['state', 'year', 'pop'], dtype='object')

In [36]:
frame.index.values

array([0, 1, 2, 3, 4, 5])

If you specify a sequence of columns, the DataFrame’s columns will be arranged in that order

In [37]:
data

{'state': ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada', 'Nevada'],
 'year': [2000, 2001, 2002, 2001, 2002, 2003],
 'pop': [1.5, 1.7, 3.6, 2.4, 2.9, 3.2]}

In [38]:
pd.DataFrame(data, columns=['year', 'state', 'pop'])

   year   state  pop
0  2000    Ohio  1.5
1  2001    Ohio  1.7
2  2002    Ohio  3.6
3  2001  Nevada  2.4
4  2002  Nevada  2.9
5  2003  Nevada  3.2

Also, you can sepcify the row index.

In [39]:
frame2 = pd.DataFrame(data, columns=['year', 'state', 'pop', 'debt'],
                      index=['one', 'two', 'three', 'four', 'five', 'six'])
frame2

       year   state  pop debt
one    2000    Ohio  1.5  NaN
two    2001    Ohio  1.7  NaN
three  2002    Ohio  3.6  NaN
four   2001  Nevada  2.4  NaN
five   2002  Nevada  2.9  NaN
six    2003  Nevada  3.2  NaN

In [ ]:
frame2.columns

In [ ]:
frame2.index

### Indexing and Selection

- A column in a DataFrame can be retrieved as a Series either by dict-like notation or by attribute

In [40]:
frame2

       year   state  pop debt
one    2000    Ohio  1.5  NaN
two    2001    Ohio  1.7  NaN
three  2002    Ohio  3.6  NaN
four   2001  Nevada  2.4  NaN
five   2002  Nevada  2.9  NaN
six    2003  Nevada  3.2  NaN

In [48]:
frame2['state']

one        Ohio
two        Ohio
three      Ohio
four     Nevada
five     Nevada
six      Nevada
Name: state, dtype: object

In [43]:
type(frame2['state'])

pandas.core.series.Series

In [44]:
frame2.state

one        Ohio
two        Ohio
three      Ohio
four     Nevada
five     Nevada
six      Nevada
Name: state, dtype: object

In [45]:
frame2['year'][0] # or frame2.year[0]

/var/folders/d5/jd8cs2ds0lq81wp6tr68x7800000gn/T/ipykernel_74819/564897323.py:1: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  frame2['year'][0] # or frame2.year[0]

np.int64(2000)

- Rows can also be retrieved by position or name with the special **loc** attribute

In [46]:
frame2

       year   state  pop debt
one    2000    Ohio  1.5  NaN
two    2001    Ohio  1.7  NaN
three  2002    Ohio  3.6  NaN
four   2001  Nevada  2.4  NaN
five   2002  Nevada  2.9  NaN
six    2003  Nevada  3.2  NaN

In [47]:
frame2.loc['three']

year     2002
state    Ohio
pop       3.6
debt      NaN
Name: three, dtype: object

In [ ]:
type(frame2.loc['three'])

In [ ]:
frame2.loc['three'][0]

Other options:
- ***loc***: Access a group of rows and columns by label(s).
- ***iloc***: Purely integer-location based rows and columns indexing for selection by position.
- **[   :   ,   :   ]**: Access rows by integer or labels, or access columns by labels (columns can be omitted).

In [50]:
data = pd.DataFrame(np.arange(20).reshape((4, 5)),
                    index=['Ohio', 'Colorado', 'Utah', 'New York'],
                    columns=['zero', 'one', 'two', 'three', 'four'])
data

          zero  one  two  three  four
Ohio         0    1    2      3     4
Colorado     5    6    7      8     9
Utah        10   11   12     13    14
New York    15   16   17     18    19

In [51]:
data.loc['Ohio':'Colorado','two']

Ohio        2
Colorado    7
Name: two, dtype: int64

In [ ]:
data[1:] # equals to
# data.loc['Colorado':]
# data.iloc[1:]

In [ ]:
data[0:2] #--> [] by integer
# equals to
# data.loc['Ohio':'Colorado']
# data.iloc[0:2]
# data['Ohio':'Colorado'] # --> [] by label

In [ ]:
data[['one']]

In [ ]:
data[['one','two']]

In [52]:
# data.loc['Colorado':'Utah','two':]# equal to
data.iloc[1:3,2:]

          two  three  four
Colorado    7      8     9
Utah       12     13    14

In [ ]:
data.loc[:,'one'] # equal to data['one']

In [ ]:
data[['three', 'two', 'one']] # equals to
# data.loc[:,['three', 'two', 'one']]
# data.iloc[:,[2,1,0]]

In [ ]:
data.loc[:, 'two':] # or
#data.iloc[:, 2:]
# data['two':] does not work

In [ ]:
data.loc['Colorado']
# data['Colorado'] # does not work >>> None of [Index(['Colorado'], dtype='object')] are in the [columns] <<< --> in [] single labels are only for columns
# data.iloc[1]

In [ ]:
data.loc[['Colorado']]
# data['Colorado':'Colorado']
# data.iloc[[1]]

In [ ]:
# Row and columns selection
# Examples
data.loc['Ohio':'Colorado', 'three'] # data.loc[[row], [col]] -> label
data.loc['Colorado', ['two', 'three']] # data
data.loc['Ohio':'Colorado', 'three':'four']
data.iloc[[1, 2], 1:2]
data.loc[:'Utah', 'two']
data.iloc[0:2, :] # data.iloc[[row], [col]] -> posizionale
data.iloc[2:3, [3, 0, 1]] # Utah, cols: four, one, two

Why use loc? Differences between [] and .loc[]

1.   using **.loc**, the execution time is more than 3X times faster!

2.   loc is explicit: df.loc[row_indexer, column_index] can select rows and columns.

 df[indexer] can only select rows or columns depending on the type of values in indexer and the type of column values the dataframe has.

3.  When a slice is passed to **df.loc** the **end-points are included** in the range. When a slice is passed to **df[...]**, the slice is interpreted as a **half-open** interval.

In [ ]:
x = pd.DataFrame(np.arange(9).reshape(3,3))
x

In [ ]:
x.loc[1:2].index.values

In [ ]:
x[1:2].index.values

### Filtering

In [53]:
data

          zero  one  two  three  four
Ohio         0    1    2      3     4
Colorado     5    6    7      8     9
Utah        10   11   12     13    14
New York    15   16   17     18    19

In [ ]:
data['three'] > 5

In [ ]:
data[data['three'] > 5]
# data.loc[data['three'] > 5]
# data.iloc[data['three'] > 5] # NOT working >>> iLocation based boolean indexing cannot use an indexable as a mask

In [ ]:
data >= 12

In [ ]:
data[data >= 12]
# Does NOT work with loc & iloc

In [ ]:
data

In [ ]:
data.iloc[:, :3] [(data.three > 5) & (data['four'] <15)] # combination

### Modify a DataFrame

In [54]:
data

          zero  one  two  three  four
Ohio         0    1    2      3     4
Colorado     5    6    7      8     9
Utah        10   11   12     13    14
New York    15   16   17     18    19

In [55]:
data_copy_reference = data

data_copy = data.copy()

data_view = data.iloc[2:,1:-1]

In [56]:
data_copy_reference

          zero  one  two  three  four
Ohio         0    1    2      3     4
Colorado     5    6    7      8     9
Utah        10   11   12     13    14
New York    15   16   17     18    19

In [ ]:
data_copy_reference[data_copy_reference >= 12] = 100
data_copy_reference

In [ ]:
data

In [ ]:
data_copy

In [ ]:
data_view

- Columns can be modified by assignment.

In [ ]:
frame2

In [57]:
frame2['debt'] = 16.5
frame2
# 16.5 is **broadcasted** to [16.5, 16.5, ...] == [16.5] * frame2['debt'].shape[0]

       year   state  pop  debt
one    2000    Ohio  1.5  16.5
two    2001    Ohio  1.7  16.5
three  2002    Ohio  3.6  16.5
four   2001  Nevada  2.4  16.5
five   2002  Nevada  2.9  16.5
six    2003  Nevada  3.2  16.5

- When you are assigning lists or arrays to a column, the value’s length must match the length of the DataFrame.

In [58]:
frame2['debt'] = [2,15.7,80,98,12,12]
frame2

       year   state  pop  debt
one    2000    Ohio  1.5   2.0
two    2001    Ohio  1.7  15.7
three  2002    Ohio  3.6  80.0
four   2001  Nevada  2.4  98.0
five   2002  Nevada  2.9  12.0
six    2003  Nevada  3.2  12.0

In [59]:
# viene mantenuta l'associazione con i valori dell'indice

val = pd.Series([-1.2, -1.5, -1.7], index=['two', 'four', 'five'])
frame2['debt'] = val
frame2

       year   state  pop  debt
one    2000    Ohio  1.5   NaN
two    2001    Ohio  1.7  -1.2
three  2002    Ohio  3.6   NaN
four   2001  Nevada  2.4  -1.5
five   2002  Nevada  2.9  -1.7
six    2003  Nevada  3.2   NaN

### Dropping entries from an axis: method *.drop*

In [60]:
data = pd.DataFrame(np.arange(16).reshape((4, 4)),
                    index=['Ohio', 'Colorado', 'Utah', 'New York'],
                    columns=['one', 'two', 'three', 'four'])
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [61]:
data.drop(['Colorado', 'Ohio'])

          one  two  three  four
Utah        8    9     10    11
New York   12   13     14    15

In [62]:
data.drop(['two', 'four'], axis=1)

          one  three
Ohio        0      2
Colorado    4      6
Utah        8     10
New York   12     14

In [ ]:
data

### Arithmetic and Data Alignment

In [63]:
df1 = pd.DataFrame(np.arange(9.).reshape((3, 3)), columns=list('bcd'),
                   index=['Ohio', 'Texas', 'Colorado'])

df2 = pd.DataFrame(np.arange(12.).reshape((4, 3)), columns=list('bde'),
                   index=['Utah', 'Ohio', 'Texas', 'Oregon'])

In [64]:
df1

            b    c    d
Ohio      0.0  1.0  2.0
Texas     3.0  4.0  5.0
Colorado  6.0  7.0  8.0

In [65]:
df2

          b     d     e
Utah    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0

In [66]:
df1 + df2

            b   c     d   e
Colorado  NaN NaN   NaN NaN
Ohio      3.0 NaN   6.0 NaN
Oregon    NaN NaN   NaN NaN
Texas     9.0 NaN  12.0 NaN
Utah      NaN NaN   NaN NaN

#### Arithmetic methods with fill values

In [67]:
df1 = pd.DataFrame(np.arange(12.).reshape((3, 4)),
                   columns=list('abcd'))
df2 = pd.DataFrame(np.arange(20.).reshape((4, 5)),
                   columns=list('abcde'))

In [68]:
df1

     a    b     c     d
0  0.0  1.0   2.0   3.0
1  4.0  5.0   6.0   7.0
2  8.0  9.0  10.0  11.0

In [69]:
df2

      a     b     c     d     e
0   0.0   1.0   2.0   3.0   4.0
1   5.0   6.0   7.0   8.0   9.0
2  10.0  11.0  12.0  13.0  14.0
3  15.0  16.0  17.0  18.0  19.0

In [70]:
df2.loc[1, 'b'] = np.nan

In [71]:
df2

      a     b     c     d     e
0   0.0   1.0   2.0   3.0   4.0
1   5.0   NaN   7.0   8.0   9.0
2  10.0  11.0  12.0  13.0  14.0
3  15.0  16.0  17.0  18.0  19.0

In [72]:
df1

     a    b     c     d
0  0.0  1.0   2.0   3.0
1  4.0  5.0   6.0   7.0
2  8.0  9.0  10.0  11.0

In [73]:
df1-df2

     a    b    c    d   e
0  0.0  0.0  0.0  0.0 NaN
1 -1.0  NaN -1.0 -1.0 NaN
2 -2.0 -2.0 -2.0 -2.0 NaN
3  NaN  NaN  NaN  NaN NaN

In [74]:
df1.sub(df2, fill_value=12000)

         a        b        c        d        e
0      0.0      0.0      0.0      0.0  11996.0
1     -1.0 -11995.0     -1.0     -1.0  11991.0
2     -2.0     -2.0     -2.0     -2.0  11986.0
3  11985.0  11984.0  11983.0  11982.0  11981.0

In [75]:
1 / df1

       a         b         c         d
0    inf  1.000000  0.500000  0.333333
1  0.250  0.200000  0.166667  0.142857
2  0.125  0.111111  0.100000  0.090909

In [ ]:
df1 * 144

In [ ]:
df1

### Re-indexing

In [76]:
df1

     a    b     c     d
0  0.0  1.0   2.0   3.0
1  4.0  5.0   6.0   7.0
2  8.0  9.0  10.0  11.0

In [77]:
df1.reindex(columns=['a', 'd', 'b', 'f'], fill_value=100)

     a     d    b    f
0  0.0   3.0  1.0  100
1  4.0   7.0  5.0  100
2  8.0  11.0  9.0  100

## Operations between DataFrame and Series

In [78]:
frame = pd.DataFrame(np.arange(12.).reshape((4, 3)),
                     columns=list('bde'),
                     index=['Utah', 'Ohio', 'Texas', 'Oregon'])
frame

          b     d     e
Utah    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0

In [79]:
series2 = pd.Series(range(3), index=['b', 'e', 'f'])
series2

b    0
e    1
f    2
dtype: int64

In [80]:
frame + series2

          b   d     e   f
Utah    0.0 NaN   3.0 NaN
Ohio    3.0 NaN   6.0 NaN
Texas   6.0 NaN   9.0 NaN
Oregon  9.0 NaN  12.0 NaN

In [81]:
series3 = frame['d']
series3

Utah       1.0
Ohio       4.0
Texas      7.0
Oregon    10.0
Name: d, dtype: float64

In [82]:
frame

          b     d     e
Utah    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0

In [83]:
frame + series3

        Ohio  Oregon  Texas  Utah   b   d   e
Utah     NaN     NaN    NaN   NaN NaN NaN NaN
Ohio     NaN     NaN    NaN   NaN NaN NaN NaN
Texas    NaN     NaN    NaN   NaN NaN NaN NaN
Oregon   NaN     NaN    NaN   NaN NaN NaN NaN

In [84]:
frame.add(series3, axis='index')

           b     d     e
Utah     1.0   2.0   3.0
Ohio     7.0   8.0   9.0
Texas   13.0  14.0  15.0
Oregon  19.0  20.0  21.0

### Function Application and Mapping

- *apply*: Apply a function along an axis of the DataFrame
- *map*: Apply a function to a Dataframe elementwise. This method applies a function that accepts and returns a scalar to every element of a DataFrame

In [85]:
frame = pd.DataFrame(np.random.randn(4, 3), columns=list('bde'),
                     index=['Utah', 'Ohio', 'Texas', 'Oregon'])
frame

               b         d         e
Utah   -1.192950  0.360097 -1.261220
Ohio   -0.731388 -0.665561 -1.607048
Texas  -0.886024 -1.404845 -0.363107
Oregon  1.168103  1.302754  1.760376

In [86]:
frame['b'].max()

np.float64(1.1681030173122637)

In [87]:
frame['b'].min()

np.float64(-1.1929497140134349)

In [88]:
frame

               b         d         e
Utah   -1.192950  0.360097 -1.261220
Ohio   -0.731388 -0.665561 -1.607048
Texas  -0.886024 -1.404845 -0.363107
Oregon  1.168103  1.302754  1.760376

In [89]:
def diff_max_min(x): # x pd.Series
  return x.max() - x.min()

In [90]:
frame.apply(diff_max_min)

b    2.361053
d    2.707599
e    3.367424
dtype: float64

In [91]:
frame.apply(lambda x: x.max() - x.min())

b    2.361053
d    2.707599
e    3.367424
dtype: float64

In [ ]:
frame.apply(diff_max_min, axis='columns')

In [ ]:
def get_power_2(x): # x valore
  return np.power(x, 2)

frame.map(get_power_2)

## Summarizing and Computing Descriptive Statistics

### Describe

- describe
- sum or cumsum
- mean
- count
- value_counts

In [92]:
df = pd.DataFrame([[1.4, np.nan], [7.1, -4.5],
                   [np.nan, np.nan], [0.75, -1.3]],
                  index=['a', 'b', 'c', 'd'],
                  columns=['one', 'two'])
df

    one  two
a  1.40  NaN
b  7.10 -4.5
c   NaN  NaN
d  0.75 -1.3

In [93]:
df.describe()

            one       two
count  3.000000  2.000000
mean   3.083333 -2.900000
std    3.493685  2.262742
min    0.750000 -4.500000
25%    1.075000 -3.700000
50%    1.400000 -2.900000
75%    4.250000 -2.100000
max    7.100000 -1.300000

In [94]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 4 entries, a to d
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   one     3 non-null      float64
 1   two     2 non-null      float64
dtypes: float64(2)
memory usage: 96.0+ bytes

In [95]:
df

    one  two
a  1.40  NaN
b  7.10 -4.5
c   NaN  NaN
d  0.75 -1.3

In [96]:
df.sum()

one    9.25
two   -5.80
dtype: float64

In [97]:
df.sum(axis='columns')

a    1.40
b    2.60
c    0.00
d   -0.55
dtype: float64

In [ ]:
df.mean(axis='columns', skipna=False)

In [ ]:
df

In [ ]:
df.max()

In [ ]:
df.idxmax()

### Unique Values, Value Counts, and Membership

In [98]:
obj = pd.Series(['c', 'a', 'c', 'a', 'a', 'b', 'b', 'c', 'c'])
obj

0    c
1    a
2    c
3    a
4    a
5    b
6    b
7    c
8    c
dtype: object

In [ ]:
uniques = obj.unique()
uniques

In [99]:
obj.value_counts()

c    4
a    3
b    2
Name: count, dtype: int64

In [ ]:
obj

In [100]:
obj.map(lambda x: x in ['c', 'a'])

0     True
1     True
2     True
3     True
4     True
5    False
6    False
7     True
8     True
dtype: bool

In [101]:
mask = obj.isin(['c', 'a'])

In [102]:
mask

0     True
1     True
2     True
3     True
4     True
5    False
6    False
7     True
8     True
dtype: bool

In [ ]:
obj[mask]

In [103]:
data = pd.DataFrame({'Qu1': [1, 3, 4, 3, 4],
                     'Qu2': [2, 3, 1, 2, 3],
                     'Qu3': [1, 5, 2, 4, 4]})
data

   Qu1  Qu2  Qu3
0    1    2    1
1    3    3    5
2    4    1    2
3    3    2    4
4    4    3    4

In [104]:
pd.value_counts(data["Qu1"])

/var/folders/d5/jd8cs2ds0lq81wp6tr68x7800000gn/T/ipykernel_74819/4264041146.py:1: FutureWarning: pandas.value_counts is deprecated and will be removed in a future version. Use pd.Series(obj).value_counts() instead.
  pd.value_counts(data["Qu1"])

Qu1
3    2
4    2
1    1
Name: count, dtype: int64